; domain
(define (domain navigator)


(:requirements :strips :typing :action-costs  :equality)


(:types place - object
agent - object
)


(:constants
 agent_0 agent_1 - agent
)

(:predicates 
(at ?p - place ?a - agent)
(connected ?p1 - place ?p2 - place ?a - agent)
(split)
(ag0_done)
)



(:functions (total-cost) - number)


(:action move_together 
 :parameters ( ?src - place ?dst - place) 
 :precondition (and (at  ?src agent_0)(at  ?src agent_1)(connected  ?src ?dst agent_0)(connected  ?src ?dst agent_1)(not(split) )) 
 :effect (and (at  ?dst agent_0)(at  ?dst agent_1)(increase (total-cost) 19980 )(not (at  ?src agent_0))(not (at  ?src agent_1))) 
) 

(:action move_seperate_#0 
 :parameters ( ?src - place ?dst - place) 
 :precondition (and (at  ?src agent_0)(connected  ?src ?dst agent_0)(split )(not(ag0_done) )) 
 :effect (and (at  ?dst agent_0)(increase (total-cost) 10000 )(not (at  ?src agent_0))) 
) 

(:action move_seperate_#1 
 :parameters ( ?src - place ?dst - place) 
 :precondition (and (at  ?src agent_1)(connected  ?src ?dst agent_1)(split )(ag0_done )) 
 :effect (and (at  ?dst agent_1)(increase (total-cost) 10000 )(not (at  ?src agent_1))) 
) 

(:action split-agents 
 :parameters () 
 :precondition (and (not(split) )) 
 :effect (and (split )(increase (total-cost) 0 )) 
) 

(:action agent-0-done 
 :parameters () 
 :precondition (and (not(ag0_done) )(split )) 
 :effect (and (ag0_done )(increase (total-cost) 0 )) 
) 

)

; problem
(define (problem simple5_5)

(:domain navigator)

(:objects
place_0_0 place_0_1 place_0_2 place_0_3 place_0_4
place_1_0 place_1_1 place_1_2 place_1_3 place_1_4
place_2_0 place_2_1 place_2_2 place_2_3 place_2_4
place_3_0 place_3_1 place_3_2 place_3_3 place_3_4
place_4_0 place_4_1 place_4_2 place_4_3 place_4_4
- place
)

(:init
(connected place_0_0 place_1_0  agent_0)(connected place_0_0 place_1_0  agent_1)(connected place_0_0 place_0_1  agent_0)(connected place_0_0 place_0_1  agent_1)(connected place_0_1 place_1_1  agent_0)(connected place_0_1 place_1_1  agent_1)(connected place_0_1 place_0_0  agent_0)(connected place_0_1 place_0_0  agent_1)(connected place_0_1 place_0_2  agent_0)(connected place_0_1 place_0_2  agent_1)(connected place_0_2 place_1_2  agent_0)(connected place_0_2 place_1_2  agent_1)(connected place_0_2 place_0_1  agent_0)(connected place_0_2 place_0_1  agent_1)(connected place_0_2 place_0_3  agent_0)(connected place_0_2 place_0_3  agent_1)(connected place_0_3 place_1_3  agent_0)(connected place_0_3 place_1_3  agent_1)(connected place_0_3 place_0_2  agent_0)(connected place_0_3 place_0_2  agent_1)(connected place_0_3 place_0_4  agent_0)(connected place_0_3 place_0_4  agent_1)(connected place_0_4 place_1_4  agent_0)(connected place_0_4 place_1_4  agent_1)(connected place_0_4 place_0_3  agent_0)(connected place_0_4 place_0_3  agent_1)(connected place_1_0 place_0_0  agent_0)(connected place_1_0 place_0_0  agent_1)(connected place_1_0 place_2_0  agent_0)(connected place_1_0 place_2_0  agent_1)(connected place_1_0 place_1_1  agent_0)(connected place_1_0 place_1_1  agent_1)(connected place_1_1 place_0_1  agent_0)(connected place_1_1 place_0_1  agent_1)(connected place_1_1 place_2_1  agent_0)(connected place_1_1 place_2_1  agent_1)(connected place_1_1 place_1_0  agent_0)(connected place_1_1 place_1_0  agent_1)(connected place_1_1 place_1_2  agent_0)(connected place_1_1 place_1_2  agent_1)(connected place_1_2 place_0_2  agent_0)(connected place_1_2 place_0_2  agent_1)(connected place_1_2 place_2_2  agent_0)(connected place_1_2 place_2_2  agent_1)(connected place_1_2 place_1_1  agent_0)(connected place_1_2 place_1_1  agent_1)(connected place_1_2 place_1_3  agent_0)(connected place_1_2 place_1_3  agent_1)(connected place_1_3 place_0_3  agent_0)(connected place_1_3 place_0_3  agent_1)(connected place_1_3 place_2_3  agent_0)(connected place_1_3 place_2_3  agent_1)(connected place_1_3 place_1_2  agent_0)(connected place_1_3 place_1_2  agent_1)(connected place_1_3 place_1_4  agent_0)(connected place_1_3 place_1_4  agent_1)(connected place_1_4 place_0_4  agent_0)(connected place_1_4 place_0_4  agent_1)(connected place_1_4 place_2_4  agent_0)(connected place_1_4 place_2_4  agent_1)(connected place_1_4 place_1_3  agent_0)(connected place_1_4 place_1_3  agent_1)(connected place_2_0 place_1_0  agent_0)(connected place_2_0 place_1_0  agent_1)(connected place_2_0 place_3_0 agent_0)(connected place_2_0 place_3_0 agent_1)(connected place_2_1 place_1_1  agent_0)(connected place_2_1 place_1_1  agent_1)(connected place_2_1 place_3_1  agent_0)(connected place_2_1 place_3_1  agent_1)(connected place_2_1 place_2_0  agent_0)(connected place_2_1 place_2_0  agent_1)(connected place_2_1 place_2_2  agent_0)(connected place_2_1 place_2_2  agent_1)(connected place_2_2 place_1_2  agent_0)(connected place_2_2 place_1_2  agent_1)(connected place_2_2 place_3_2  agent_0)(connected place_2_2 place_3_2  agent_1)(connected place_2_2 place_2_1  agent_0)(connected place_2_2 place_2_1  agent_1)(connected place_2_2 place_2_3  agent_0)(connected place_2_2 place_2_3  agent_1)(connected place_2_3 place_1_3  agent_0)(connected place_2_3 place_1_3  agent_1)(connected place_2_3 place_3_3  agent_0)(connected place_2_3 place_3_3  agent_1)(connected place_2_3 place_2_2  agent_0)(connected place_2_3 place_2_2  agent_1)(connected place_2_3 place_2_4  agent_0)(connected place_2_3 place_2_4  agent_1)(connected place_2_4 place_1_4  agent_0)(connected place_2_4 place_1_4  agent_1)(connected place_2_4 place_3_4  agent_0)(connected place_2_4 place_3_4  agent_1)(connected place_2_4 place_2_3  agent_0)(connected place_2_4 place_2_3  agent_1)(connected place_3_0 place_2_0  agent_0)(connected place_3_0 place_2_0  agent_1)(connected place_3_0 place_4_0  agent_0)(connected place_3_0 place_4_0  agent_1)(connected place_3_0 place_3_1  agent_0)(connected place_3_0 place_3_1  agent_1)(connected place_3_1 place_2_1  agent_0)(connected place_3_1 place_2_1  agent_1)(connected place_3_1 place_4_1  agent_0)(connected place_3_1 place_4_1  agent_1)(connected place_3_1 place_3_0  agent_0)(connected place_3_1 place_3_0  agent_1)(connected place_3_1 place_3_2  agent_0)(connected place_3_1 place_3_2  agent_1)(connected place_3_2 place_2_2  agent_0)(connected place_3_2 place_2_2  agent_1)(connected place_3_2 place_4_2  agent_0)(connected place_3_2 place_4_2  agent_1)(connected place_3_2 place_3_1  agent_0)(connected place_3_2 place_3_1  agent_1)(connected place_3_2 place_3_3  agent_0)(connected place_3_2 place_3_3  agent_1)(connected place_3_3 place_2_3  agent_0)(connected place_3_3 place_2_3  agent_1)(connected place_3_3 place_4_3  agent_0)(connected place_3_3 place_4_3  agent_1)(connected place_3_3 place_3_2  agent_0)(connected place_3_3 place_3_2  agent_1)(connected place_3_3 place_3_4  agent_0)(connected place_3_3 place_3_4  agent_1)(connected place_3_4 place_2_4  agent_0)(connected place_3_4 place_2_4  agent_1)(connected place_3_4 place_4_4  agent_0)(connected place_3_4 place_4_4  agent_1)(connected place_3_4 place_3_3  agent_0)(connected place_3_4 place_3_3  agent_1)(connected place_4_0 place_3_0  agent_0)(connected place_4_0 place_3_0  agent_1)(connected place_4_0 place_4_1  agent_0)(connected place_4_0 place_4_1  agent_1)(connected place_4_1 place_3_1  agent_0)(connected place_4_1 place_3_1  agent_1)(connected place_4_1 place_4_0  agent_0)(connected place_4_1 place_4_0  agent_1)(connected place_4_1 place_4_2  agent_0)(connected place_4_1 place_4_2  agent_1)(connected place_4_2 place_3_2  agent_0)(connected place_4_2 place_3_2  agent_1)(connected place_4_2 place_4_1  agent_0)(connected place_4_2 place_4_1  agent_1)(connected place_4_2 place_4_3  agent_0)(connected place_4_2 place_4_3  agent_1)(connected place_4_3 place_3_3  agent_0)(connected place_4_3 place_3_3  agent_1)(connected place_4_3 place_4_2  agent_0)(connected place_4_3 place_4_2  agent_1)(connected place_4_3 place_4_4  agent_0)(connected place_4_3 place_4_4  agent_1)(connected place_4_4 place_3_4  agent_0)(connected place_4_4 place_3_4  agent_1)(connected place_4_4 place_4_3  agent_0)(connected place_4_4 place_4_3  agent_1)(connected place_2_0 place_2_1  agent_0)(connected place_2_0 place_2_1  agent_1)(connected place_2_1 place_2_2  agent_0)(connected place_2_1 place_2_2  agent_1)(connected place_2_2 place_2_3 agent_0)(connected place_2_2 place_2_3 agent_1)(connected place_2_3 place_2_4 agent_0)(connected place_2_3 place_2_4 agent_1)(connected place_2_4 place_1_4 agent_0)(connected place_2_4 place_1_4 agent_1)(connected place_1_4 place_0_4 agent_0)(connected place_1_4 place_0_4 agent_1)(connected place_2_4 place_3_4 agent_0)(connected place_2_4 place_3_4 agent_1)(connected place_3_4 place_4_4 agent_0)(connected place_3_4 place_4_4 agent_1)(at place_2_0 agent_0)(at place_2_0 agent_1)( not ( split ) )(= (total-cost) 0)
)

(:goal 
 (and 
(at place_4_4 agent_0)(at place_0_4 agent_1)))
(:metric minimize (total-cost))
)

; plan
1. (move_together place_2_0 place_2_1)
   deleted: (at place_2_0 agent_0) (at place_2_0 agent_1)
   added: (at place_2_1 agent_0) (at place_2_1 agent_1)
   goals met: 0 of 2
2. (move_together place_2_1 place_2_2)
   deleted: (at place_2_1 agent_0) (at place_2_1 agent_1)
   added: (at place_2_2 agent_0) (at place_2_2 agent_1)
   goals met: 0 of 2
3. (move_together place_2_2 place_2_3)
   deleted: (at place_2_2 agent_0) (at place_2_2 agent_1)
   added: (at place_2_3 agent_0) (at place_2_3 agent_1)
   goals met: 0 of 2
4. (move_together place_2_3 place_2_4)
   deleted: (at place_2_3 agent_0) (at place_2_3 agent_1)
   added: (at place_2_4 agent_0) (at place_2_4 agent_1)
   goals met: 0 of 2
5. (split-agents)
   added: (split)
   goals met: 0 of 2
6. (move_seperate_#0 place_2_4 place_3_4)
   deleted: (at place_2_4 agent_0)
   added: (at place_3_4 agent_0)
   goals met: 0 of 2
7. (move_seperate_#0 place_3_4 place_4_4)
   deleted: (at place_3_4 agent_0)
   added: (at place_4_4 agent_0)
   goals met: 1 of 2
8. (agent-0-done)
   added: (ag0_done)
   goals met: 1 of 2
9. (move_seperate_#1 place_2_4 place_1_4)
   deleted: (at place_2_4 agent_1)
   added: (at place_1_4 agent_1)
   goals met: 1 of 2
10. (move_seperate_#1 place_1_4 place_0_4)
   deleted: (at place_1_4 agent_1)
   added: (at place_0_4 agent_1)
   goals met: 2 of 2
